In [16]:
import pandas as pd

def find_classes(courses: pd.DataFrame) -> pd.DataFrame:
    courses = courses.groupby('class').agg({'student': 'nunique'})
    courses = courses[courses['student'] >= 5]
    courses = courses.reset_index()[["class"]]
    return courses

In [2]:
data = [['A', 'Math'], ['B', 'English'], ['C', 'Math'], ['D', 'Biology'], ['E', 'Math'], ['F', 'Computer'], ['G', 'Math'], ['H', 'Math'], ['I', 'Math']]
Courses = pd.DataFrame(data, columns=['student', 'class']).astype({'student':'object', 'class':'object'})
Courses

  student     class
0       A      Math
1       B   English
2       C      Math
3       D   Biology
4       E      Math
5       F  Computer
6       G      Math
7       H      Math
8       I      Math

In [19]:
Courses.groupby('class').groups

{'Biology': [3], 'Computer': [5], 'English': [1], 'Math': [0, 2, 4, 6, 7, 8]}

In [17]:
Courses.groupby('class')["student"].nunique()

class
Biology     1
Computer    1
English     1
Math        6
Name: student, dtype: int64

In [24]:
Courses.groupby('class').count()

          student
class
Biology         1
Computer        1
English         1
Math            6

In [18]:
find_classes(Courses)

  class
0  Math